# операции сравнения
print(5==2)
print(5!=2)
print(5>2)
print(5<2)
print(5>=2)
print(5<=2)
print("\n")

# вывод логических данных с помощью разных команд
x=73
print(x%4==0)
print(x%4!=0)
print(not x%4==0)
print(not x%4!=0)
print("\n")

# and выводит true если все варианты соответствуют условиям проверки
a=5
b=7
print(a>0 and b>0)
print("\n")

# or выдает true если хотя бы один вариант соответствует условиям проверки
print(a!=0 or b!=7)

# !!! в одной строке последовательность выполнения следующая - not, and, or !!!